In [1]:
%load_ext sql

In [3]:
%sql mysql+pymysql://root:easwari@localhost

--> generate numbers between 1 to 10 using {recursive cte}

In [7]:
%%sql

with recursive `number_series` as
(
   select 1 as `number`

   union all

   select `number`+1 as `number`
   from `number_series`
   where `number` < 10
)    
select * from number_series;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[(1,), (2,), (3,), (4,), (5,), (6,), (7,), (8,), (9,), (10,)]

--> generate numbers between 1 to 10 using {generate_series()} --> function in postgress sql

In [9]:
%sql postgresql://postgres:easwari@localhost:5432

In [14]:
%%sql
select generate_series(1,10) as numbers;

   mysql+pymysql://root:***@localhost
 * postgresql://postgres:***@localhost:5432
10 rows affected.

[(1,), (2,), (3,), (4,), (5,), (6,), (7,), (8,), (9,), (10,)]